#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0xC0 (0xC0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.UserConstructionScript
struct ABP_Elevator_Transition_C_UserConstructionScript_Params
{
public:
	struct FVector                               CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_70B5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CallFunc_GetDisplayName_ReturnValue;               // 0x10(0x10)(ZeroConstructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_X;                            // 0x20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_Y;                            // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_Z;                            // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Add_FloatFloat_ReturnValue;               // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x30(0x30)(IsPlainOldData, NoDestructor)
	float                                        CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x60(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue;            // 0x64(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_FTrunc_ReturnValue;                       // 0x68(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_70B6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CallFunc_Conv_IntToString_ReturnValue;             // 0x70(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Concat_StrStr_ReturnValue;                // 0x80(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                  CallFunc_Conv_StringToName_ReturnValue;            // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                CallFunc_Concat_StrStr_ReturnValue_1;              // 0x98(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0xA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  CallFunc_Conv_StringToName_ReturnValue_1;          // 0xB0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.Timeline_0__FinishedFunc
struct ABP_Elevator_Transition_C_Timeline_0__FinishedFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.Timeline_0__UpdateFunc
struct ABP_Elevator_Transition_C_Timeline_0__UpdateFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.Timeline_1__FinishedFunc
struct ABP_Elevator_Transition_C_Timeline_1__FinishedFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.Timeline_1__UpdateFunc
struct ABP_Elevator_Transition_C_Timeline_1__UpdateFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.Timeline_2__FinishedFunc
struct ABP_Elevator_Transition_C_Timeline_2__FinishedFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.Timeline_2__UpdateFunc
struct ABP_Elevator_Transition_C_Timeline_2__UpdateFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.Output Camera Position
struct ABP_Elevator_Transition_C_Output_Camera_Position_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.Open Doors
struct ABP_Elevator_Transition_C_Open_Doors_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.CloseDoors
struct ABP_Elevator_Transition_C_CloseDoors_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.StartMoveUp
struct ABP_Elevator_Transition_C_StartMoveUp_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.StopMoveUp
struct ABP_Elevator_Transition_C_StopMoveUp_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.StartMoveDown
struct ABP_Elevator_Transition_C_StartMoveDown_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.StopMoveDown
struct ABP_Elevator_Transition_C_StopMoveDown_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.OpenInstant
struct ABP_Elevator_Transition_C_OpenInstant_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.CloseInstant
struct ABP_Elevator_Transition_C_CloseInstant_Params
{
public:
};

// 0x50 (0x50 - 0x0)
// Function BP_Elevator_Transition.BP_Elevator_Transition_C.ExecuteUbergraph_BP_Elevator_Transition
struct ABP_Elevator_Transition_C_ExecuteUbergraph_BP_Elevator_Transition_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_70B7[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x10(0x30)(IsPlainOldData, NoDestructor)
	class UAudioComponent*                       CallFunc_SpawnSound2D_ReturnValue;                 // 0x40(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       CallFunc_SpawnSound2D_ReturnValue_1;               // 0x48(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
