#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.CanCommitNavigationRequest
struct ABP_Frontend_IntertiveCatToy_C_CanCommitNavigationRequest_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.Timeline_0__FinishedFunc
struct ABP_Frontend_IntertiveCatToy_C_Timeline_0__FinishedFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.Timeline_0__UpdateFunc
struct ABP_Frontend_IntertiveCatToy_C_Timeline_0__UpdateFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.Timeline_2__FinishedFunc
struct ABP_Frontend_IntertiveCatToy_C_Timeline_2__FinishedFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.Timeline_2__UpdateFunc
struct ABP_Frontend_IntertiveCatToy_C_Timeline_2__UpdateFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.Push3__FinishedFunc
struct ABP_Frontend_IntertiveCatToy_C_Push3__FinishedFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.Push3__UpdateFunc
struct ABP_Frontend_IntertiveCatToy_C_Push3__UpdateFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.Timeline_3__FinishedFunc
struct ABP_Frontend_IntertiveCatToy_C_Timeline_3__FinishedFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.Timeline_3__UpdateFunc
struct ABP_Frontend_IntertiveCatToy_C_Timeline_3__UpdateFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.ReceiveBeginPlay
struct ABP_Frontend_IntertiveCatToy_C_ReceiveBeginPlay_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.Commit_OnSpecialInteraction
struct ABP_Frontend_IntertiveCatToy_C_Commit_OnSpecialInteraction_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.HandleObjectSpecialInteraction
struct ABP_Frontend_IntertiveCatToy_C_HandleObjectSpecialInteraction_Params
{
public:
	struct FGameplayTag                          ActionTag;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          CameraTag;                                         // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x2C0 (0x2C0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.ExecuteUbergraph_BP_Frontend_IntertiveCatToy
struct ABP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_RLerp_ReturnValue;                        // 0x4(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_RLerp_ReturnValue_1;                      // 0x10(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_RLerp_ReturnValue_2;                      // 0x1C(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_RLerp_ReturnValue_3;                      // 0x28(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                        Temp_int_Variable;                                 // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Variable_1;                               // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Variable_2;                               // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          K2Node_Event_ActionTag;                            // 0x40(0x8)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          K2Node_Event_CameraTag;                            // 0x48(0x8)(NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchInteger_CmpSuccess;                   // 0x50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_7177[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue_1;                 // 0x58(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue_2;                 // 0x5C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_VLerp_ReturnValue;                        // 0x60(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                            CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x6C(0x8C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                               CallFunc_VLerp_ReturnValue_1;                      // 0xF8(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                            CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1; // 0x104(0x8C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                               CallFunc_VLerp_ReturnValue_2;                      // 0x190(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                            CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_2; // 0x19C(0x8C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                               CallFunc_VLerp_ReturnValue_3;                      // 0x228(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                            CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_3; // 0x234(0x8C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// 0x0 (0x0 - 0x0)
// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.FinalPushDone__DelegateSignature
struct ABP_Frontend_IntertiveCatToy_C_FinalPushDone__DelegateSignature_Params
{
public:
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
