#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x10 (0x10 - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.AnimGraph
struct UFortnite_Base_Tail_AnimBP_C_AnimGraph_Params
{
public:
	struct FPoseLink                             AnimGraph;                                         // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_4E73C08A41114BBB798C98BAF38B00DB
struct UFortnite_Base_Tail_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_4E73C08A41114BBB798C98BAF38B00DB_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_0421F1ED47466E02393D109D708977F7
struct UFortnite_Base_Tail_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_0421F1ED47466E02393D109D708977F7_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_62D9552B41666E676B55159211408DD0
struct UFortnite_Base_Tail_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_62D9552B41666E676B55159211408DD0_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_C5B779F8485834C4DC389A98B0B43B31
struct UFortnite_Base_Tail_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_C5B779F8485834C4DC389A98B0B43B31_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_B2A9002E421DC72E5ED848899CD3DEF6
struct UFortnite_Base_Tail_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_B2A9002E421DC72E5ED848899CD3DEF6_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_6D073FA240E82B3DDA2C4CB6B8D6E215
struct UFortnite_Base_Tail_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_AnimGraphNode_TransitionResult_6D073FA240E82B3DDA2C4CB6B8D6E215_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.AnimNotify_JumpLandExit
struct UFortnite_Base_Tail_AnimBP_C_AnimNotify_JumpLandExit_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.AnimNotify_RollRandomIdle
struct UFortnite_Base_Tail_AnimBP_C_AnimNotify_RollRandomIdle_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.BlueprintUpdateAnimation
struct UFortnite_Base_Tail_AnimBP_C_BlueprintUpdateAnimation_Params
{
public:
	float                                        DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x2C (0x2C - 0x0)
// Function Fortnite_Base_Tail_AnimBP.Fortnite_Base_Tail_AnimBP_C.ExecuteUbergraph_Fortnite_Base_Tail_AnimBP
struct UFortnite_Base_Tail_AnimBP_C_ExecuteUbergraph_Fortnite_Base_Tail_AnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue;                    // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue_1;                  // 0x6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_1;                // 0x7(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_2;                // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue_1;                 // 0xA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue_2;                 // 0xB(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                        CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue_3;                 // 0x11(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_3;                // 0x12(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue_4;                 // 0x13(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                        CallFunc_RandomInteger_ReturnValue;                // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_4;                // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5BFE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_RandomIntegerInRange_ReturnValue;         // 0x1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue_5;                 // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5BFF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Clamp_ReturnValue;                        // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_Event_DeltaTimeX;                           // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
