#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.Construct
struct UPlayerSurveyPanel_C_Construct_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.OutroDone
struct UPlayerSurveyPanel_C_OutroDone_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.StartIntro
struct UPlayerSurveyPanel_C_StartIntro_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.StartIntro_BP
struct UPlayerSurveyPanel_C_StartIntro_BP_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.OnPlayerSurveyEnded
struct UPlayerSurveyPanel_C_OnPlayerSurveyEnded_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.ExecuteUbergraph_PlayerSurveyPanel
struct UPlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5A45[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x8(0x10)(ZeroConstructor, NoDestructor)
	float                                        Temp_float_Variable;                               // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Temp_float_Variable_1;                             // 0x1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue;                // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue_1;              // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsMobilePlatform_ReturnValue;             // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5A46[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        K2Node_Select_Default;                             // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
